Белгипрозем_2017/src/InformationRegisters/СвязиДокументов/СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиДокументов</name>
  <resources>
    <name>СвязанныйДокументОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязаннаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСвязанныйДокумент</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>String</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Ранг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКорреспондентыДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписалОтКорреспондента</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПродления</name>
    <type>
      <types>EnumRef.ПорядокПродления</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераЭтапов</name>
    <comment>На какие этапы влияет доп. соглашение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <comment>Ссылка на этап договора</comment>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>мСостояниеДела</name>
    <comment>Текущее состояние дела</comment>
    <type>
      <types>EnumRef.мСостоянияДела</types>
    </type>
  </attributes>
  <attributes>
    <name>мСистемаКоординат</name>
    <type>
      <types>CatalogRef.мСистемаКоординат</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерГеопортала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мНомерТехархива</name>
    <comment>Не используется!</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мИнвентарныйНомерТехархива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаНачалаДействияДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>мЗаказчик</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>мНомерДелаЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мДатаДелаЗаказчика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>мПроверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>мВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
      <types>CatalogRef.мВидыРаботФизЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>мКакДоговорЮрЛица</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>мДокументыВозвращеныЗаказчику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоляОбъекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Инвесторы</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписалОтКорреспондента</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/мРазное/Module.bsl
// Заполняет договор в этапе договора
// Применяется во внешней обработке ЗаполнитьДоговорыВЭтапах 
//
// Параметры:
//  ТаблицаЭтапов>  - ТаблицаЗначений - 
//  ИндексНачала  - Число
//  РазмерПроции  - Число
//
&НаСервере
Процедура ЗаполнитьДоговорВЭтапеДоговора(ТаблицаЭтапов, ИндексНачала, РазмерПроции) Экспорт
	// заполняем догвор только для определенной части таблицы
	Для Сч = 1 По РазмерПроции Цикл
		Индекс = ?(Сч=1, ИндексНачала, Индекс+1);
		ЭтапОбъект = ТаблицаЭтапов[Индекс].Ссылка.ПолучитьОбъект();
		ЭтапОбъект.Договор = ТаблицаЭтапов[Индекс].Договор;		
		ЭтапОбъект.Записать();
	КонецЦикла;
КонецПроцедуры // ЗаполнитьДоговорВЭтапеДоговора()

&НаСервере
Функция ПолучитьКоличествоДелПоЭтапу(ЭтапСсылка) Экспорт
   
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнутренниеДокументы.Ссылка) КАК КоличествоДел
        |ИЗ
        |	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
        |ГДЕ
        |	НЕ ВнутренниеДокументы.ПометкаУдаления
        |	И ВнутренниеДокументы.ЭтапДоговора = &ЭтапДоговора
        |	И ВнутренниеДокументы.ВидДокумента = &ВидДокумента";
    
    Запрос.УстановитьПараметр("ЭтапДоговора", ЭтапСсылка);
    Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.Дело);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.КоличествоДел;
    КонецЕсли; 
    
КонецФункции

&НаСервере
Функция КоличествоДелПоДоговору(Договор) Экспорт
   
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнутренниеДокументы.Ссылка) КАК КоличествоДел
        |ИЗ
        |	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
        |ГДЕ
        |	НЕ ВнутренниеДокументы.ПометкаУдаления
        |	И ВнутренниеДокументы.ЭтапДоговора.Владелец = &Договор
        |	И ВнутренниеДокументы.ВидДокумента = &ВидДокумента";
    
    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.Дело);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = РезультатЗапроса.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.КоличествоДел;
    КонецЕсли; 
КонецФункции

&НаСервере
Функция ПолучитьКоличествоДелУслугиПоДоговору(ДоговорСсылка) Экспорт
   
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнутренниеДокументы.Ссылка) КАК КоличествоДел
        |ИЗ
        |	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДокументов КАК СвязиДокументов
        |		ПО СвязиДокументов.Документ = ВнутренниеДокументы.Ссылка
        |ГДЕ
        |	НЕ ВнутренниеДокументы.ПометкаУдаления
        |	И ВнутренниеДокументы.ВидДокумента = &ВидДокумента
        |	И СвязиДокументов.СвязанныйДокумент = &ДоговорСсылка";
    
    Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
    Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыВнутреннихДокументов.ДелоУслуги);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.КоличествоДел;
    КонецЕсли; 
    
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСправокПроверкиПоДоговору(ДоговорСсылка) Экспорт
   
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ мСправкиПроверки.Ссылка) КАК КоличествоСправок
        |ИЗ
        |	Справочник.мСправкиПроверки КАК мСправкиПроверки
        |ГДЕ
        |	НЕ мСправкиПроверки.ПометкаУдаления
        |	И мСправкиПроверки.Договор = &ДоговорСсылка";
    
    Запрос.УстановитьПараметр("ДоговорСсылка", ДоговорСсылка);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.КоличествоСправок;
    КонецЕсли; 
    
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСправокПроверкиПоДелу(ДелоСсылка, ВидПроверки) Экспорт
   
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ мСправкиПроверки.Ссылка) КАК КоличествоСправок
        |ИЗ
        |	Справочник.мСправкиПроверки КАК мСправкиПроверки
        |ГДЕ
        |	НЕ мСправкиПроверки.ПометкаУдаления
        |	И мСправкиПроверки.Владелец = &ДелоСсылка
        |	И мСправкиПроверки.ВидПроверкиКачества = &ВидПроверки";
    
		Запрос.УстановитьПараметр("ДелоСсылка", ДелоСсылка);
		Запрос.УстановитьПараметр("ВидПроверки", ВидПроверки);
   
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.КоличествоСправок;
    КонецЕсли; 
    
КонецФункции

// Функция ЭтоДелегат(Кого)
//
// Параметры:
//  ОтКого  - <Пользователь> - тот кто делегирует права
// Возвращаемое значение:
//   Булево   - истина, если текущему пользователю делегированы права
//
&НаСервере
Функция ПравДелегированы(ОтКого) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьЗаписи
	|ИЗ
	|	Справочник.ДелегированиеПрав КАК ДелегированиеПрав
	|ГДЕ
	|	ДелегированиеПрав.Кому = &Пользователь
	|	И (ДелегированиеПрав.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДелегированиеПрав.ДатаНачалаДействия <= &ТекущаяДата)
	|	И (ДелегированиеПрав.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДелегированиеПрав.ДатаОкончанияДействия >= &ТекущаяДата)
	|	И НЕ ДелегированиеПрав.ПометкаУдаления
	|	И ДелегированиеПрав.ОтКого = &ОтКого");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ОтКого", ОтКого);
	
	ЭтоДелегат = Не Запрос.Выполнить().Пустой();
	
	Возврат ЭтоДелегат;

КонецФункции // ПравДелегированы()

&НаСервере
Функция УПользователяЕстьРоль(Пользователь, ИмяРоли) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   ГруппыПользователейСостав.Ссылка КАК ГруппаПользователей
        |ПОМЕСТИТЬ ГруппыПользователей
        |ИЗ
        |   Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
        |ГДЕ
        |   ГруппыПользователейСостав.Пользователь = &Пользователь
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ПрофилиГруппДоступаРоли.Ссылка КАК Профиль
        |ПОМЕСТИТЬ Профили
        |ИЗ
        |   Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
        |ГДЕ
        |   ПрофилиГруппДоступаРоли.Роль.Имя = &ИмяРоли
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ГруппыДоступаПользователи.Ссылка.Ссылка КАК Ссылка
        |ИЗ
        |   Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
        |ГДЕ
        |   (ГруппыДоступаПользователи.Пользователь = &Пользователь
        |           ИЛИ ГруппыДоступаПользователи.Пользователь В
        |               (ВЫБРАТЬ
        |                   ГруппыПользователей.ГруппаПользователей
        |               ИЗ
        |                   ГруппыПользователей КАК ГруппыПользователей))
        |   И ГруппыДоступаПользователи.Ссылка.Профиль В
        |           (ВЫБРАТЬ
        |               Профили.Профиль
        |           ИЗ
        |               Профили КАК Профили)";
	
	Запрос.УстановитьПараметр("ИмяРоли", ИмяРоли);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции	

// Возвращает настройки сканирования дел
&НаСервере
Функция ПолучитьНастройкиСканированияДел(ИдентификаторКлиента) Экспорт
	СохранятьВАрхив = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСканированияДел/СохранятьВАрхив", ИдентификаторКлиента);
	Если СохранятьВАрхив = Неопределено Тогда
		СохранятьВАрхив = Ложь;
		ХранилищеОбщихНастроек.Сохранить("НастройкиСканированияДел/СохранятьВАрхив", ИдентификаторКлиента, СохранятьВАрхив);
	КонецЕсли;
	
	КаталогНаДиске = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСканированияДел/КаталогНаДиске", ИдентификаторКлиента);
	Если КаталогНаДиске = Неопределено Тогда
		КаталогНаДиске = "";
		ХранилищеОбщихНастроек.Сохранить("НастройкиСканированияДел/КаталогНаДиске", ИдентификаторКлиента, КаталогНаДиске);
	КонецЕсли;
	
	ПутьКАрхивуФайлов = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСканированияДел/ПутьКАрхивуФайлов", ИдентификаторКлиента);
	Если ПутьКАрхивуФайлов = Неопределено Тогда
		ПутьКАрхивуФайлов = "";
		ХранилищеОбщихНастроек.Сохранить("НастройкиСканированияДел/ПутьКАрхивуФайлов", ИдентификаторКлиента, ПутьКАрхивуФайлов);
	КонецЕсли;
	
	РайонПоУмолчаниюДляСкановДел = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиСканированияДел/РайонПоУмолчаниюДляСкановДел", ИдентификаторКлиента);
	Если РайонПоУмолчаниюДляСкановДел = Неопределено Тогда
		РайонПоУмолчаниюДляСкановДел = "";
		ХранилищеОбщихНастроек.Сохранить("НастройкиСканированияДел/РайонПоУмолчаниюДляСкановДел", ИдентификаторКлиента, РайонПоУмолчаниюДляСкановДел);
	КонецЕсли;
	
	НастройкиСканированияДел = Новый Структура;
	НастройкиСканированияДел.Вставить("КаталогНаДиске", КаталогНаДиске);
	НастройкиСканированияДел.Вставить("СохранятьВАрхив", СохранятьВАрхив);
	НастройкиСканированияДел.Вставить("ПутьКАрхивуФайлов", ПутьКАрхивуФайлов);
	НастройкиСканированияДел.Вставить("РайонПоУмолчаниюДляСкановДел", РайонПоУмолчаниюДляСкановДел);
	Возврат НастройкиСканированияДел;
КонецФункции // ПолучитьНастройкиСканированияДел()

// Возвращает Булево - настройки сканирования дел заполнены или нет
&НаСервере
Функция НастройкиСканированияДелНеЗаполнены(Настройки) Экспорт
	ЕстьОшибки = Ложь;
	КаталогНаДиске = Неопределено;
	СохранятьВАрхив = Неопределено;
	ПутьКАрхивуФайлов = Неопределено;
	РайонПоУмолчаниюДляСкановДел = Неопределено;
	
	Если Настройки.Свойство("КаталогНаДиске") Тогда
		КаталогНаДиске = Настройки.КаталогНаДиске;
	КонецЕсли; 
	
	Если Настройки.Свойство("СохранятьВАрхив") Тогда
		СохранятьВАрхив = Настройки.СохранятьВАрхив;
	КонецЕсли; 
	
	Если Настройки.Свойство("ПутьКАрхивуФайлов") Тогда
		ПутьКАрхивуФайлов = Настройки.ПутьКАрхивуФайлов;
	КонецЕсли; 
	
	Если Настройки.Свойство("РайонПоУмолчаниюДляСкановДел") Тогда
		РайонПоУмолчаниюДляСкановДел = Настройки.РайонПоУмолчаниюДляСкановДел;
	КонецЕсли; 
	
	Если КаталогНаДиске = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран каталог для загрузки в настройке сканирования дел!'"), , "КаталогНаДиске");
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если СохранятьВАрхив = Неопределено Тогда
		// остальные можно не анализировать	
	Иначе
		Если ПутьКАрхивуФайлов = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан путь к архиву файлов в настройке сканирования дел!'"), , "ПутьКАрхивуФайлов");
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если РайонПоУмолчаниюДляСкановДел = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан район по умолчанию в настройке сканирования дел!'"), , "РайонПоУмолчаниюДляСкановДел");
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
КонецФункции // НастройкиСканированияДелНеЗаполнены()

&НаСервере
Функция ПолучитьКомиссию(Комиссия) Экспорт
	РеквизитыКомиссии = Новый Структура("НомерПриказа, ДатаПриказа, Председатель, ЧленКомиссии1, ЧленКомиссии2, ЧленКомиссии3, ЧленКомиссии4,
		| ДолжностьПредседателя, Должность1, Должность2, Должность3, Должность4");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мКомиссии.НомерПриказа,
		|	мКомиссии.ДатаПриказа,
		|	мКомиссии.Председатель,
		|	мКомиссии.ЧленКомиссии1,
		|	мКомиссии.ЧленКомиссии2,
		|	мКомиссии.ЧленКомиссии3,
		|	мКомиссии.ЧленКомиссии4,
		|	ВЫБОР
		|		КОГДА СведенияОПользователях.Пользователь = мКомиссии.Председатель
		|			ТОГДА СведенияОПользователях.Должность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДолжностьПредседателя,
		|	ВЫБОР
		|		КОГДА СведенияОПользователях.Пользователь = мКомиссии.ЧленКомиссии1
		|			ТОГДА СведенияОПользователях.Должность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Должность1,
		|	ВЫБОР
		|		КОГДА СведенияОПользователях.Пользователь = мКомиссии.ЧленКомиссии2
		|			ТОГДА СведенияОПользователях.Должность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Должность2,
		|	ВЫБОР
		|		КОГДА СведенияОПользователях.Пользователь = мКомиссии.ЧленКомиссии3
		|			ТОГДА СведенияОПользователях.Должность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Должность3,
		|	ВЫБОР
		|		КОГДА СведенияОПользователях.Пользователь = мКомиссии.ЧленКомиссии4
		|			ТОГДА СведенияОПользователях.Должность
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Должность4
		|ИЗ
		|	Справочник.мКомиссии КАК мКомиссии,
		|	РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
		|ГДЕ
		|	мКомиссии.Ссылка = &Комиссия
		|	И НЕ мКомиссии.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Комиссия", Комиссия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыКомиссии, Выборка); 
	КонецЕсли;   
	
	Возврат РеквизитыКомиссии;	

КонецФункции // ПолучитьКомиссию()

&НаСервере
Функция ПолучитьГородБазы() Экспорт
	Если Константы.М_Брест.Получить() Тогда
		Возврат "Брест";
	ИначеЕсли Константы.М_Минск.Получить() Тогда
		Возврат "Минск";
	ИначеЕсли Константы.М_Гродно.Получить() Тогда
		Возврат "Гродно";
	ИначеЕсли Константы.М_Прилуки.Получить() Тогда
		Возврат "Прилуки";
	ИначеЕсли Константы.М_Витебск.Получить() Тогда
		Возврат "Витебск";
	ИначеЕсли Константы.М_Гомель.Получить() Тогда
		Возврат "Гомель";
	ИначеЕсли Константы.М_Могилев.Получить() Тогда
		Возврат "Могилев";
	КонецЕсли; 
	Возврат "";
КонецФункции // ПолучитьГородБазы()

// Если Источник - Пользователь, то возвращает город из подразделения пользователя
// Если Источник - Подразделение, то возвращает город из подразделения
// Если в подразделении не указан город, то возвращается город из Констант
// Если Источник не указан, то возвращает город из подразделения текущего пользователя 
&НаСервере
Функция ПолучитьГородПодразделения(Источник = "") Экспорт
	ГородПодразделения = "";
	
	Если ЗначениеЗаполнено(Источник) Тогда
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.Пользователи") Тогда
			ТекущееПодразделение = РаботаСПользователями.ПолучитьПодразделение(Источник);
			ГородПодразделения	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущееПодразделение, "Город");
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
			ГородПодразделения	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(Источник, "Город");
		КонецЕсли; 
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		ТекущееПодразделение = РаботаСПользователями.ПолучитьПодразделение(ТекущийПользователь);
		ГородПодразделения	= ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущееПодразделение, "Город");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГородПодразделения) Тогда
		ГородПодразделения = мРазное.ПолучитьГородБазы();
	КонецЕсли; 
	
	Возврат ГородПодразделения;
КонецФункции // ПолучитьГородПодразделения()

&НаСервере
Функция НашГород(СтруктураНашихРеквизитов = "") Экспорт
	Город = "";
	
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		// Город получаем из подразделения исполнителя
		Город = мРазное.ПолучитьГородПодразделения();
	
	ИначеЕсли ГородБазы = "Минск" Тогда
		Если СтруктураНашихРеквизитов <> "" И 
			СтруктураНашихРеквизитов.Свойство("НашГород") Тогда
			Город = СтруктураНашихРеквизитов.НашГород;
		Иначе	
			Город = мРазное.ПолучитьГородБазы();
		КонецЕсли; 
		
	ИначеЕсли ГородБазы = "Прилуки" Тогда
		Если СтруктураНашихРеквизитов <> "" И 
			СтруктураНашихРеквизитов.Свойство("НашГород") Тогда
			Город = СтруктураНашихРеквизитов.НашГород;
		Иначе	
			Город = ГородБазы;
		КонецЕсли; 
		
	ИначеЕсли ГородБазы = "Гродно" Тогда
		Город = мРазное.ПолучитьГородБазы();
	КонецЕсли; 
	
	Возврат Город;
КонецФункции 
 
// Формирует инициалы и фамилию либо по наименованию элемента справочника ФизическиеЛица,
// либо по переданным строкам, либо по наименованию элемента справочника Пользователи.
// Если передан Объект, то извлеченная из него строка считается совокупностью 
// Фамилия + Имя + Отчество, разделенными пробелами.
//
// Параметры
//  ОбъектИлиСтрока - строка, ссылка или объект элемента справочника ФизическиеЛица, Ссылка на Пользователя.
//  Фамилия		    - фамилия физического лица.
//  Имя		        - имя физического лица.
//  Отчество	    - отчество физического лица.
//
// Возвращаемое значение 
//  Строка - инициалы и фамилия одной строкой. 
//  В параметрах Фамилия, Имя и Отчество записываются вычисленные части.
//
// Пример:
//  Результат = ФамилияИнициалыФизЛица("Иванов Иван Иванович"); // Результат = "Иванов И. И."
//
&НаСервере
Функция ИнициалыФамилияПользователя(ОбъектИлиСтрока = "", Фамилия = " ", Имя = " ", Отчество = " ") Экспорт

	ТипОбъекта = ТипЗнч(ОбъектИлиСтрока);
	Если ТипОбъекта = Тип("Строка") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока), " ");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") Или ТипОбъекта = Тип("СправочникОбъект.ФизическиеЛица") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока.Наименование), " ");
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.Пользователи") Тогда
		ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ОбъектИлиСтрока.Наименование), " ");
	Иначе
		// используем возможно переданные отдельные строки
		Возврат 
		?(Не ПустаяСтрока(Фамилия), 
		          ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество,1) + ".", ""), "")+ Фамилия,
		          "")
	КонецЕсли;
	
	КоличествоПодстрок = ФИО.Количество();
	Фамилия            = ?(КоличествоПодстрок > 0, ФИО[0], "");
	Имя                = ?(КоличествоПодстрок > 1, ФИО[1], "");
	Отчество           = ?(КоличествоПодстрок > 2, ФИО[2], "");
	
	Возврат ?(Не ПустаяСтрока(Фамилия), 
	          ?(Не ПустаяСтрока(Имя), " " + Лев(Имя,1) + "." + ?(Не ПустаяСтрока(Отчество), Лев(Отчество, 1) + ".", ""), "") + Фамилия,
	          "");
КонецФункции

&НаСервере
Функция ПолучитьОперациюСканераШтрихкода(ИдентификаторКлиента) Экспорт
	Операция = 
		ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкаОперацииСканераШтрихкода", ИдентификаторКлиента);
	Возврат Операция;		
КонецФункции

// Возвращает в зависимости от даты количество разрядов для округления
&НаСервере
Функция ЗнакОкр(Дата) Экспорт
	Если Дата < Дата(2016, 7, 1) Тогда
		Возврат 0;
	Иначе	
	    Возврат 2;
	КонецЕсли; 
КонецФункции // ЗнакОкр()

&НаСервере
Функция ПолучитьНашГород(СтруктураНашихРеквизитов = "") Экспорт
	Город = "";
	
	ГородБазы = мРазное.ПолучитьГородБазы();
	Если ГородБазы = "Брест" Тогда
		// Город получаем из подразделения исполнителя
		Город = мРазное.ПолучитьГородПодразделения();
	
	ИначеЕсли ГородБазы = "Минск" Тогда
		Если СтруктураНашихРеквизитов.Свойство("НашГород") Тогда
			Город = СтруктураНашихРеквизитов.НашГород;
		Иначе	
			Город = мРазное.ПолучитьГородБазы();
		КонецЕсли; 
		
	ИначеЕсли ГородБазы = "Прилуки" Тогда
		Если СтруктураНашихРеквизитов.Свойство("НашГород") Тогда
			Город = СтруктураНашихРеквизитов.НашГород;
		Иначе	
			Город = ГородБазы;
		КонецЕсли; 
		
	ИначеЕсли ГородБазы = "Гродно" Тогда
		Город = мРазное.ПолучитьГородБазы();
	КонецЕсли; 
	
	Возврат Город;
КонецФункции // ПолучитьНашГород()

&НаСервере
Функция ПолучитьИспользоватьОтборПоПодразделениям() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.м_ИспользоватьОтборПоПодразделениям.Получить();
	
КонецФункции	

Функция ЭтоТестирование() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ЭтоТестирование = Константы.мТестирование.Получить();
	Возврат ЭтоТестирование;	

КонецФункции
